[wave,fs]=audioread('fmt.wav');
L=length(wave);%确定fmt.wav的数据总数
mu=16.384;%fmt.wav长度为16.384s
y=mu*fs;%通过y进行验证：y=a说明mu的长度没有错误
MU=[0.096,0.267,1.767,2.234,2.706,3.146,3.606...
    4.056,4.520,5.030,5.749,5.978,7.015,7.709,7.923...
    8.028,8.490,8.959,9.454,9.852,10.125,10.356...
    10.565,10.822,11.292,11.741,12.284,12.741...
    13.269,13.758,14.315,14.939,15.432];
%手动标定的音调时间节点
time=floor(MU*L/mu);
%将时间节点转换为采样节点，采样节点必须是整数，故加floor
%而一两个采样节点的偏差也不影响主要结果
n=length(time);
for i=1:n
    if i==1
        un=wave(1:time(i)-1);
    else
        un=wave(time(i-1):time(i)-1);
    end
    %将音调数据存入un
    un=repmat(un,1000,1);
    [y1(i,1:5),y2(i,1:5)]=analysis(un,fs);
    %保存音调的频率和幅度
end
        
